import pandas as pd
import pytest


@pytest.fixture
def data():
    return pd.DataFrame(
        [
            {"Дата операции": "01.03.2024 12:00:00", "Категория": "Еда", "Сумма": 500},
            {"Дата операции": "10.05.2024 10:00:00", "Категория": "Еда", "Сумма": 700},
            {"Дата операции": "01.01.2024 09:00:00", "Категория": "Транспорт", "Сумма": 200},
        ]
    )


@pytest.fixture
def transactions():
    return [
        {"Дата операции": "01.03.2024 12:00:00", "Категория": "Еда", "Сумма": 500},
        {"Дата операции": "10.05.2024 10:00:00", "Категория": "Еда", "Сумма": 700},
        {"Дата операции": "01.01.2024 09:00:00", "Категория": "Транспорт", "Сумма": 200},
    ]


@pytest.fixture
def card():
    return [
        {
            "Номер карты": "1234567812345678",
            "Сумма операции с округлением": 1000.0,
        },
        {
            "Номер карты": "8765432187654321",
            "Сумма операции с округлением": 250.75,
        },
    ]


@pytest.fixture
def transactions_data():
    return [
        {
            "Дата операции": "2024-06-01 12:00:00",
            "Сумма операции с округлением": 1000,
            "Категория": "Еда",
            "Описание": "Макдоналдс",
        },
        {
            "Дата операции": "2024-06-02 12:00:00",
            "Сумма операции с округлением": 300,
            "Категория": "Транспорт",
            "Описание": "Метро",
        },
        {
            "Дата операции": "2024-06-03 12:00:00",
            "Сумма операции с округлением": 700,
            "Категория": "Магазин",
            "Описание": "Пятерочка",
        },
        {
            "Дата операция": "2024-06-04 12:00:00",
            "Сумма операции с округлением": 50,
            "Категория": "Разное",
            "Описание": "Кофе",
        },
        {
            "Дата операции": "2024-06-05 12:00:00",
            "Сумма операции с округлением": 5000,
            "Категория": "Путешествия",
            "Описание": "Билеты",
        },
        {
            "Дата операции": "2024-06-06 12:00:00",
            "Сумма операции с округлением": 1200,
            "Категория": "Здоровье",
            "Описание": "Аптека",
        },
    ]


@pytest.fixture
def mock_transactions():
    return [
        {"Категория": "Еда", "Сумма": 100},
        {"Категория": "Развлечения", "Сумма": 200},
        {"Категория": "Еда и напитки", "Сумма": 150},
    ]
